In [ ]:
import numpy as np
import pandas as pd

In [ ]:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 4, 3, 5, 3, 6, 1, 7, 1]
}

In [ ]:
df=pd.DataFrame(exam_data)

In [ ]:
selected_columns=df[['name','score']]

In [ ]:
print(selected_columns)

        name  score
0  Anastasia   12.5
1       Dima    9.0
2  Katherine   16.5
3      James    NaN
4      Emily    9.0
5    Michael   20.0
6    Matthew   14.5
7      Laura    NaN
8      Kevin    8.0
9      Jonas   19.0

In [ ]:
select=df[df['attempts']>3]
print(select)

        name  score  attempts
2  Katherine   16.5         4
4      Emily    9.0         5
6    Matthew   14.5         6
8      Kevin    8.0         7

In [ ]:
data = {
 'name': ['Alice', 'Bob', 'Charlie', 'Dave'],
 'age': [25, 35, 40, 28],

 'gender': ['F', 'M', 'M', 'M'],

 'salary': [50000, 70000, 60000, 80000]}

In [ ]:
df=pd.DataFrame(data)

In [ ]:
selected_rows=df[df['age']>30]
print(selected_rows)

      name  age gender  salary
1      Bob   35      M   70000
2  Charlie   40      M   60000

In [ ]:
selected_name = df[df['name'].str.contains('e',case=False,na=False)]
print(selected_name)

      name  age gender  salary
0    Alice   25      F   50000
2  Charlie   40      M   60000
3     Dave   28      M   80000

In [ ]:
selected_salary=df[(df['gender']=='M') & (df['salary']>65000)]
print(selected_salary)

   name  age gender  salary
1   Bob   35      M   70000
3  Dave   28      M   80000

In [ ]:
selected_columns=df[['name','age']]
print(selected_columns)

      name  age
0    Alice   25
1      Bob   35
2  Charlie   40
3     Dave   28